app/controllers/clientes_controller.rb

  def index
    @clientes = Cliente.paginate(:page => params[:page], :per_page => 10)
---
SELECT `cliente`.* FROM `cliente`