app/controllers/clientes_controller.rb

INSERT INTO `cliente` VALUES ()
---
  def create
    @cliente = Cliente.new(cliente_params)

    respond_to do |format|
      if @cliente.save

SELECT  `cliente`.* FROM `cliente`  WHERE `cliente`.`ID_CLIENTE` = 2  ORDER BY `cliente`.`ID_CLIENTE` ASC LIMIT 1
---
    def set_cliente
      if current_vendedor
        @cliente = Cliente.find(params[:id])


      else
      @cliente = Cliente.find(current_cliente)