app/controllers/disfrazs_controller.rb

  def index
      @categorias = Categoria.all
      @disfrazs = Disfraz.paginate(:page => params[:page], :per_page => 6)
---
SELECT `disfraz`.* FROM `disfraz`

  def create
    @disfraz = Disfraz.new(disfraz_params)
    @disfraz.save
---
INSERT INTO `disfraz` VALUES ()