app/controllers/vendedors_controller.rb

  def index
    @vendedors = Vendedor.paginate(:page => params[:page], :per_page => 10)
---
SELECT `vendedor`.* FROM `vendedor`